Revit 2024 API
ElementFilter Class
 A base class for a type of filter that accepts or rejects elements based upon criteria.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ElementFilter : IDisposable
Visual Basic
Public Class ElementFilter _
	Implements IDisposable
Visual C++
public ref class ElementFilter : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementLogicalFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementSlowFilter
See Also
ElementFilter Members
Autodesk.Revit.DB Namespace